БПКР/src/Catalogs/Районы/Районы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Районы</name>
  <tabularSections>
    <name>удалитьСтавкиЗемельногоНалога</name>
    <attributes>
      <name>ВидЗемельногоУчастка</name>
      <type>
        <types>EnumRef.ВидыЗемельныхУчастков</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/InformationRegisters/СтавкиЗемельногоНалогаПоРайонам/СтавкиЗемельногоНалогаПоРайонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиЗемельногоНалогаПоРайонам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Район</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗемельногоУчастка</name>
    <type>
      <types>EnumRef.ВидыЗемельныхУчастков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Catalogs/Районы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтавкиЗемельногоНалога(ДополнительныеПараметры) Экспорт

	Результат = РаботаСКонтрагентамиБП.РеквизитыСтавкиНалогов("ratesLandTaxDistricts");
	
	Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда 
		Возврат;
	КонецЕсли;	
	
	// Получение из XML.
	КлассификаторXML = Результат.КлассификаторXML;
	ТаблицаСтавкиЗемельногоНалога = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	ТаблицаСтавкиЗемельногоНалога.Индексы.Добавить("КодРайона");
	
	ПериодЗаполнения = ОбщегоНазначенияБПСервер.ПолучитьПериодИзXML(КлассификаторXML);
		
	НаборЗаписей = РегистрыСведений.СтавкиЗемельногоНалогаПоРайонам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Район.Установить(ДополнительныеПараметры.Ссылка);
	НаборЗаписей.Отбор.Период.Установить(ПериодЗаполнения);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НайденныеСтроки = ТаблицаСтавкиЗемельногоНалога.НайтиСтроки(Новый Структура("КодРайона", ДополнительныеПараметры.Код));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, НайденнаяСтрока);
		Запись.Период = ПериодЗаполнения;
		Запись.Район = ДополнительныеПараметры.Ссылка;
		Запись.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков[НайденнаяСтрока.ВидЗемельногоУчастка];
		
	КонецЦикла;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
